#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ittechlearning/Testing-Production-Public-AWS-VPC/runs/run-xD3fCE7bYNMCt5cr

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
aws_vpc.TestProdPublic_VPC: Refreshing state... [id=vpc-0e05ebc261b4dc80d]
aws_subnet.TestProdPublic_Private_Bckup_us-east-2b: Refreshing state... [id=subnet-0c7f113c1cb7dab0e]
aws_route_table.TestProdPublic_Public_Bckup_RT: Refreshing state... [id=rtb-0bffaa758d525683e]
aws_route_table.TestProdPublic_Management_Pri_RT: Refreshing state... [id=rtb-09a495f5a52a26b4e]
aws_subnet.TestProdPublic_DMZ_Bckup_us-east-2b: Refreshing state... [id=subnet-0edbe933a614761bd]
aws_internet_gateway.TestProd_IGW: Refreshing state... [id=igw-0a30290aa63e2dfed]
aws_route_table.TestProdPublic_DMZ_Pri_RT: Refreshing state... [id=rtb-04d9f9cd6bbb99f47]
aws_subnet.TestProdPublic_Management_Pri_us-east-2a: Refreshing state... [id=subnet-02b43d1a74aea8146]
aws_subnet.TestProdPublic_Public_Pri_us-east-2a: Refreshing state... [id=subnet-0cc77049b88933fef]
aws_subnet.TestProdPublic_Private_Pri_us-east-2a: Refreshing state... [id=subnet-0173ff0961a63050a]
aws_subnet.TestProdPublic_Management_Bckup_us-east-2b: Refreshing state... [id=subnet-02dc229a92b73edf4]
aws_route_table.TestProdPublic_DMZ_Bckup_RT: Refreshing state... [id=rtb-02df24d5f9e01e4f4]
aws_subnet.TestProdPublic_DMZ_Pri_us-east-2a: Refreshing state... [id=subnet-07bb73196a2e84833]
aws_route_table.TestProdPublic_Private_Pri_RT: Refreshing state... [id=rtb-03b30b224c3da17fc]
aws_route_table.TestProdPublic_Management_Bckup_RT: Refreshing state... [id=rtb-092648a8fac4b09ec]
aws_route_table.TestProdPublic_Public_Pri_RT: Refreshing state... [id=rtb-04ac6877ca3fa2b1c]
aws_route_table.TestProdPublic_Private_Bckup_RT: Refreshing state... [id=rtb-07ce5183172952133]
aws_subnet.TestProdPublic_Public_Bckup_us-east-2b: Refreshing state... [id=subnet-070ece131dae472d6]
aws_route_table_association.TestProdPublic_Management_Pri: Refreshing state... [id=rtbassoc-0d7dc660cea571cac]
aws_route.TestProdPublic_Management_Pri_Default_Route_Outbound: Refreshing state... [id=r-rtb-09a495f5a52a26b4e1080289494]
aws_route.TestProdPublic_Public_Bckup_Default_Route_Outbound: Refreshing state... [id=r-rtb-0bffaa758d525683e1080289494]
aws_route_table_association.TestProdPublic_DMZ_Bckup: Refreshing state... [id=rtbassoc-0121a84ff08a1b39a]
aws_route.TestProdPublic_Management_Bckup_Default_Route_Outbound: Refreshing state... [id=r-rtb-092648a8fac4b09ec1080289494]
aws_route_table_association.TestProdPublic_Management_Bckup: Refreshing state... [id=rtbassoc-06a5a78906f8a55b5]
aws_route_table_association.TestProdPublic_Private_Pri: Refreshing state... [id=rtbassoc-0366244959127bb5d]
aws_route_table_association.TestProdPublic_Public_Pri: Refreshing state... [id=rtbassoc-083b3cba006601303]
aws_route.TestProdPublic_Public_Pri_Default_Route_Outbound: Refreshing state... [id=r-rtb-04ac6877ca3fa2b1c1080289494]
aws_route_table_association.TestProdPublic_DMZ_Pri: Refreshing state... [id=rtbassoc-091b7622a753a19d5]
aws_route_table_association.TestProdPublic_Private_Bckup: Refreshing state... [id=rtbassoc-06454b7cb409c8431]
aws_route_table_association.TestProdPublic_Public_Bckup: Refreshing state... [id=rtbassoc-00e1718eb46b6c0fe]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_internet_gateway.TestProd_IGW has been deleted
  - resource "aws_internet_gateway" "TestProd_IGW" {
      - id       = "igw-0a30290aa63e2dfed" -> null
        tags     = {
            "Name" = "TestProdPublic_IGW"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_route_table.TestProdPublic_DMZ_Bckup_RT has been deleted
  - resource "aws_route_table" "TestProdPublic_DMZ_Bckup_RT" {
      - id               = "rtb-02df24d5f9e01e4f4" -> null
        tags             = {
            "Name" = "TestProdPublic_DMZ_Bckup_RT"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_route_table.TestProdPublic_DMZ_Pri_RT has been deleted
  - resource "aws_route_table" "TestProdPublic_DMZ_Pri_RT" {
      - id               = "rtb-04d9f9cd6bbb99f47" -> null
        tags             = {
            "Name" = "TestProdPublic_DMZ_Pri_RT"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_route_table.TestProdPublic_Management_Bckup_RT has been deleted
  - resource "aws_route_table" "TestProdPublic_Management_Bckup_RT" {
      - id               = "rtb-092648a8fac4b09ec" -> null
        tags             = {
            "Name" = "TestProdPublic_Management_Bckup_RT"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_route_table.TestProdPublic_Management_Pri_RT has been deleted
  - resource "aws_route_table" "TestProdPublic_Management_Pri_RT" {
      - id               = "rtb-09a495f5a52a26b4e" -> null
        tags             = {
            "Name" = "TestProdPublic_Management_Pri_RT"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_route_table.TestProdPublic_Private_Bckup_RT has been deleted
  - resource "aws_route_table" "TestProdPublic_Private_Bckup_RT" {
      - id               = "rtb-07ce5183172952133" -> null
        tags             = {
            "Name" = "TestProdPublic_Private_Bckup_RT"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_route_table.TestProdPublic_Private_Pri_RT has been deleted
  - resource "aws_route_table" "TestProdPublic_Private_Pri_RT" {
      - id               = "rtb-03b30b224c3da17fc" -> null
        tags             = {
            "Name" = "TestProdPublic_Private_Pri_RT"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_route_table.TestProdPublic_Public_Bckup_RT has been deleted
  - resource "aws_route_table" "TestProdPublic_Public_Bckup_RT" {
      - id               = "rtb-0bffaa758d525683e" -> null
        tags             = {
            "Name" = "TestProdPublic_Public_Bckup_RT"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_route_table.TestProdPublic_Public_Pri_RT has been deleted
  - resource "aws_route_table" "TestProdPublic_Public_Pri_RT" {
      - id               = "rtb-04ac6877ca3fa2b1c" -> null
        tags             = {
            "Name" = "TestProdPublic_Public_Pri_RT"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_subnet.TestProdPublic_DMZ_Bckup_us-east-2b has been deleted
  - resource "aws_subnet" "TestProdPublic_DMZ_Bckup_us-east-2b" {
      - id                                             = "subnet-0edbe933a614761bd" -> null
        tags                                           = {
            "Name" = "TestProdPublic_DMZ_Bckup_us-east-2b"
        }
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.TestProdPublic_DMZ_Pri_us-east-2a has been deleted
  - resource "aws_subnet" "TestProdPublic_DMZ_Pri_us-east-2a" {
      - id                                             = "subnet-07bb73196a2e84833" -> null
        tags                                           = {
            "Name" = "TestProdPublic_DMZ_Pri_us-east-2a"
        }
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.TestProdPublic_Management_Bckup_us-east-2b has been deleted
  - resource "aws_subnet" "TestProdPublic_Management_Bckup_us-east-2b" {
      - id                                             = "subnet-02dc229a92b73edf4" -> null
        tags                                           = {
            "Name" = "TestProdPublic_Management_Bckup_us-east-2b"
        }
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.TestProdPublic_Management_Pri_us-east-2a has been deleted
  - resource "aws_subnet" "TestProdPublic_Management_Pri_us-east-2a" {
      - id                                             = "subnet-02b43d1a74aea8146" -> null
        tags                                           = {
            "Name" = "TestProdPublic_Management_Pri_us-east-2a"
        }
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.TestProdPublic_Private_Bckup_us-east-2b has been deleted
  - resource "aws_subnet" "TestProdPublic_Private_Bckup_us-east-2b" {
      - id                                             = "subnet-0c7f113c1cb7dab0e" -> null
        tags                                           = {
            "Name" = "TestProdPublic_Private_Bckup_us-east-2b"
        }
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.TestProdPublic_Private_Pri_us-east-2a has been deleted
  - resource "aws_subnet" "TestProdPublic_Private_Pri_us-east-2a" {
      - id                                             = "subnet-0173ff0961a63050a" -> null
        tags                                           = {
            "Name" = "TestProdPublic_Private_Pri_us-east-2a"
        }
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.TestProdPublic_Public_Bckup_us-east-2b has been deleted
  - resource "aws_subnet" "TestProdPublic_Public_Bckup_us-east-2b" {
      - id                                             = "subnet-070ece131dae472d6" -> null
        tags                                           = {
            "Name" = "TestProdPublic_Public_Bckup_us-east-2b"
        }
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.TestProdPublic_Public_Pri_us-east-2a has been deleted
  - resource "aws_subnet" "TestProdPublic_Public_Pri_us-east-2a" {
      - id                                             = "subnet-0cc77049b88933fef" -> null
        tags                                           = {
            "Name" = "TestProdPublic_Public_Pri_us-east-2a"
        }
        # (15 unchanged attributes hidden)
    }

  # aws_vpc.TestProdPublic_VPC has been deleted
  - resource "aws_vpc" "TestProdPublic_VPC" {
      - id                                   = "vpc-0e05ebc261b4dc80d" -> null
        tags                                 = {
            "Name" = "TestProdPublic_VPC"
        }
        # (17 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_internet_gateway.TestProd_IGW will be created
  + resource "aws_internet_gateway" "TestProd_IGW" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "TestProdPublic_IGW"
        }
      + tags_all = {
          + "Name" = "TestProdPublic_IGW"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route.TestProdPublic_Management_Bckup_Default_Route_Outbound will be created
  + resource "aws_route" "TestProdPublic_Management_Bckup_Default_Route_Outbound" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.TestProdPublic_Management_Pri_Default_Route_Outbound will be created
  + resource "aws_route" "TestProdPublic_Management_Pri_Default_Route_Outbound" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.TestProdPublic_Public_Bckup_Default_Route_Outbound will be created
  + resource "aws_route" "TestProdPublic_Public_Bckup_Default_Route_Outbound" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.TestProdPublic_Public_Pri_Default_Route_Outbound will be created
  + resource "aws_route" "TestProdPublic_Public_Pri_Default_Route_Outbound" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.TestProdPublic_DMZ_Bckup_RT will be created
  + resource "aws_route_table" "TestProdPublic_DMZ_Bckup_RT" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "TestProdPublic_DMZ_Bckup_RT"
        }
      + tags_all         = {
          + "Name" = "TestProdPublic_DMZ_Bckup_RT"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.TestProdPublic_DMZ_Pri_RT will be created
  + resource "aws_route_table" "TestProdPublic_DMZ_Pri_RT" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "TestProdPublic_DMZ_Pri_RT"
        }
      + tags_all         = {
          + "Name" = "TestProdPublic_DMZ_Pri_RT"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.TestProdPublic_Management_Bckup_RT will be created
  + resource "aws_route_table" "TestProdPublic_Management_Bckup_RT" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "TestProdPublic_Management_Bckup_RT"
        }
      + tags_all         = {
          + "Name" = "TestProdPublic_Management_Bckup_RT"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.TestProdPublic_Management_Pri_RT will be created
  + resource "aws_route_table" "TestProdPublic_Management_Pri_RT" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "TestProdPublic_Management_Pri_RT"
        }
      + tags_all         = {
          + "Name" = "TestProdPublic_Management_Pri_RT"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.TestProdPublic_Private_Bckup_RT will be created
  + resource "aws_route_table" "TestProdPublic_Private_Bckup_RT" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "TestProdPublic_Private_Bckup_RT"
        }
      + tags_all         = {
          + "Name" = "TestProdPublic_Private_Bckup_RT"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.TestProdPublic_Private_Pri_RT will be created
  + resource "aws_route_table" "TestProdPublic_Private_Pri_RT" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "TestProdPublic_Private_Pri_RT"
        }
      + tags_all         = {
          + "Name" = "TestProdPublic_Private_Pri_RT"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.TestProdPublic_Public_Bckup_RT will be created
  + resource "aws_route_table" "TestProdPublic_Public_Bckup_RT" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "TestProdPublic_Public_Bckup_RT"
        }
      + tags_all         = {
          + "Name" = "TestProdPublic_Public_Bckup_RT"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.TestProdPublic_Public_Pri_RT will be created
  + resource "aws_route_table" "TestProdPublic_Public_Pri_RT" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "TestProdPublic_Public_Pri_RT"
        }
      + tags_all         = {
          + "Name" = "TestProdPublic_Public_Pri_RT"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.TestProdPublic_DMZ_Bckup will be created
  + resource "aws_route_table_association" "TestProdPublic_DMZ_Bckup" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.TestProdPublic_DMZ_Pri will be created
  + resource "aws_route_table_association" "TestProdPublic_DMZ_Pri" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.TestProdPublic_Management_Bckup will be created
  + resource "aws_route_table_association" "TestProdPublic_Management_Bckup" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.TestProdPublic_Management_Pri will be created
  + resource "aws_route_table_association" "TestProdPublic_Management_Pri" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.TestProdPublic_Private_Bckup will be created
  + resource "aws_route_table_association" "TestProdPublic_Private_Bckup" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.TestProdPublic_Private_Pri will be created
  + resource "aws_route_table_association" "TestProdPublic_Private_Pri" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.TestProdPublic_Public_Bckup will be created
  + resource "aws_route_table_association" "TestProdPublic_Public_Bckup" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.TestProdPublic_Public_Pri will be created
  + resource "aws_route_table_association" "TestProdPublic_Public_Pri" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.TestProdPublic_DMZ_Bckup_us-east-2b will be created
  + resource "aws_subnet" "TestProdPublic_DMZ_Bckup_us-east-2b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.7.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "TestProdPublic_DMZ_Bckup_us-east-2b"
        }
      + tags_all                                       = {
          + "Name" = "TestProdPublic_DMZ_Bckup_us-east-2b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.TestProdPublic_DMZ_Pri_us-east-2a will be created
  + resource "aws_subnet" "TestProdPublic_DMZ_Pri_us-east-2a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "TestProdPublic_DMZ_Pri_us-east-2a"
        }
      + tags_all                                       = {
          + "Name" = "TestProdPublic_DMZ_Pri_us-east-2a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.TestProdPublic_Management_Bckup_us-east-2b will be created
  + resource "aws_subnet" "TestProdPublic_Management_Bckup_us-east-2b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "TestProdPublic_Management_Bckup_us-east-2b"
        }
      + tags_all                                       = {
          + "Name" = "TestProdPublic_Management_Bckup_us-east-2b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.TestProdPublic_Management_Pri_us-east-2a will be created
  + resource "aws_subnet" "TestProdPublic_Management_Pri_us-east-2a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "TestProdPublic_Management_Pri_us-east-2a"
        }
      + tags_all                                       = {
          + "Name" = "TestProdPublic_Management_Pri_us-east-2a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.TestProdPublic_Private_Bckup_us-east-2b will be created
  + resource "aws_subnet" "TestProdPublic_Private_Bckup_us-east-2b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "TestProdPublic_Private_Bckup_us-east-2b"
        }
      + tags_all                                       = {
          + "Name" = "TestProdPublic_Private_Bckup_us-east-2b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.TestProdPublic_Private_Pri_us-east-2a will be created
  + resource "aws_subnet" "TestProdPublic_Private_Pri_us-east-2a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "TestProdPublic_Private_Pri_us-east-2a"
        }
      + tags_all                                       = {
          + "Name" = "TestProdPublic_Private_Pri_us-east-2a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.TestProdPublic_Public_Bckup_us-east-2b will be created
  + resource "aws_subnet" "TestProdPublic_Public_Bckup_us-east-2b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "TestProdPublic_Public_Bckup_us-east-2b"
        }
      + tags_all                                       = {
          + "Name" = "TestProdPublic_Public_Bckup_us-east-2b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.TestProdPublic_Public_Pri_us-east-2a will be created
  + resource "aws_subnet" "TestProdPublic_Public_Pri_us-east-2a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "TestProdPublic_Public_Pri_us-east-2a"
        }
      + tags_all                                       = {
          + "Name" = "TestProdPublic_Public_Pri_us-east-2a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.TestProdPublic_VPC will be created
  + resource "aws_vpc" "TestProdPublic_VPC" {
      + arn                                  = (known after apply)
      + cidr_block                           = "192.168.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "TestProdPublic_VPC"
        }
      + tags_all                             = {
          + "Name" = "TestProdPublic_VPC"
        }
    }

Plan: 30 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @drobinson-cl, Action: `pull_request`*